import 'package:flutter/material.dart';

class MalekSah extends StatelessWidget {
  const MalekSah({super.key});

  @override
  Widget build(BuildContext context) {
    return const Column(
      crossAxisAlignment: CrossAxisAlignment.start,
      children: [
        Text(
            'কক্সবাজারের সাগরদ্বীপ কুতুবদিয়ায় আধ্যাত্মিক সাধক শাহ আবদুল মালেক মহিউদ্দিন আজমী আল কুতুবী (রহ.) মাজার। যার লাখো ভক্তঅনুরাগী ছড়িয়ে আছে সারাদেশে। দরবারের প্রতিষ্ঠাতা শাহ আব্দুল মালেক আল কুতুবী। এখানেই জন্মগ্রহণ করেন ১৯১১ সালে। ২০০০ সালের ১১ ফেব্রুয়ারি তিনি মারা যান। প্রতিবছর তার মৃত্যুবার্ষিকীতে (৭ ফাল্গুন) হাজারো ভক্তের সমাগম ঘটে এখানে। কথিত আছে কুতুবদিয়ার নামকরণ হয়েছে কুতুব আউলিয়ার পূর্বপুরুষদের নামানুসারেই।আবদুল মালেক শাহ কুতুবী মুহিউদ্দিন আজমী (রহ.) ভক্তদের বলতেন, আল্লাহকে পাওয়া সহজ কাজ নয়। দাওয়াত পড়ে, সুস্বাদু খাবার খেয়ে আর ইস্ত্রি দেয়া সুন্দর সুন্দর কাপড় পরে আল্লাহকে পাওয়া যায় না। আল্লাহকে পেতে হলে ইবাদতের মধ্যে কঠোর রেয়াজত প্রয়োজন। প্রচণ্ড গরমে মাঠের শ্রমিকেরা লুঙ্গি বেঁধে কাজ করার সময় তাদের শরীর থেকে যে টপ টপ করে ঘাম ঝরে তার চেয়েও বেশি পরিশ্রম করতে হয়!'),
        SizedBox(height: 4),
        Text(
            'হযরত মালেক শাহ্ কেবলার কিছু কারামত:', style: TextStyle(fontWeight: FontWeight.bold, fontSize: 14),),
        SizedBox(height: 4),
        Text(
            'একবার চট্টগ্রামের রেল স্টেশনে গেলেন হালিশহরের হাফেজ মুনির উদ্দীন (রহ.) এবং গারাংগিয়ার বড় হুজুর (রহ.) সহ কয়েকজন। উদ্দেশ্য ছিল আজমগড়ী হযরত (রহ.)’র পীর সাহেবকে বিদায় জানানোর জন্য। আজমগড়ী সিলসিলার বহু মুরিদ ও অনুসারী ব্যক্তিবর্গও উপস্থিত থাকার কথা।আজমগড়ী হযরত (রহ.) যথারীতি সবার কাছ থেকে বিদায় নিয়ে ট্রেন ছাড়ার আগ মুহূর্তে ট্রেনে আরোহণ করে তার কক্ষে বসে পড়েন।  অপরদিকে হযরত মালেক শাহ (রহ.) চট্টগ্রাম রেল স্টেশনের প্ল্যাটফর্মে দ্রুতগতিতে পূর্ব-পশ্চিমে হাঁটাহাঁটি করতে থাকেন। আর বলতে থাকেন তার মাতৃভাষায়, অর্থাৎ চট্টগ্রামের ভাষায় ‘তুই কেনে যাবি যা চাই, আঁরে কি দিবি দি যা!’  অর্থাৎ আপনি কেমনে যাবেন যান দেখি, আমাকে কি দিবেন দিয়ে যান।রেলের গার্ড সবুজ পতাকা দেখিয়ে ট্রেন ছাড়ার দিক নির্দেশনা দিয়ে যাচ্ছে, কিন্তু চালক চেষ্টা করলেও ট্রেন চলে না, স্টার্ট নিতে পারে না। অপরদিকে, হযরত মালেক শাহ (রহ.) রেল স্টেশনের প্ল্যাটফর্মে ঐ একই কথা বারেবারে পুনরাবৃত্তি করে করে দ্রুত পায়চারি করতে থাকেন। ট্রেন না চলার কারণ মহান আল্লাহ পাকের জিন্দা অলি আজমগড়ী হযরত (রহ.) না জানার কথা নয়!তিনি ট্রেনে তার কক্ষ থেকে বেরিয়ে এসে ট্রেনের দরজায় দাঁড়ান এবং উপস্থিত সবাইকে লক্ষ্য করে বলেন, ‘মালেক কো পাকড়াও’। অর্থাৎ মালেককে ধরে নিয়ে আস।এখানে উল্লেখ্য আজমগড়ী হযরত (রহ.) তার স্বনামধন্য খলিফাগণকে এক শব্দের নামে ডাকতেন। তেমনিভাবে মালেক কো পাকড়াও বলার সঙ্গে সঙ্গে ৪-৫ জন যুবকশ্রেণির লোক দ্রুত গিয়ে প্ল্যাটফর্মে পায়চারী করা অবস্থায় হযরত মালেক শাহ (রহ.) কে ধরে ফেলেন এবং টেনে টেনে আজমগড়ী হযরত(রহ.)’র ট্রেনের কক্ষের দরজায় নিয়ে আসেন।আজমগড়ী হযরত (রহ.) হযরত মালেক শাহ (রহ.)’র ঘাড়ে একটি থাপ্পড় মারেন। সঙ্গে সঙ্গে হযরত মালেক শাহ্ হুশহারা হয়ে প্ল্যাটফর্মে পড়ে যায়। তখন আজমগড়ী হযরত (রহ.)বললেন, ‘ড্রাইভারকো বোলো ট্রেন ছাড়নে কে লিয়ে’।  অর্থাৎ ড্রাইভারকে বল ট্রেন ছাড়ার জন্য। সাথে সাথে ড্রাইভার ট্রেন চালিয়ে নিয়ে যায়।ছনুয়া মনুমিয়াজি জমিদার বাড়ির মুহাম্মদ উল্লাহ মিয়া চৌধুরী আজমগড়ী হযরত (রহ.)’র অন্যতম মুরিদ ছিলেন। তিনি ৮৫ বছর বয়সে ১৫ ডিসেম্বর ১৯৭৭ খ্রিস্টাব্দে মারা যান। আজমগড়ী হযরত (রহ.) চট্টগ্রাম অঞ্চলে সফরকালে ছনুয়া মনু মিয়াজি বাড়িতে তশরীফ নিতেন। তথায় মাগরিবের নামাজান্তে আজমগড়ী হযরত (রহ.)’র পেছনে অনেকে মোরাকাবায় (ধ্যান) নিমগ্ন থাকাটা স্বাভাবিক।উক্ত সময় হযরত মালেক শাহ (রহ.) ও অন্যান্যদের সঙ্গে মোরাকাবায় বসে যান। কিছুক্ষণ যেতে না যেতেই তার শরীরে আগুন ধরে যায়।সঙ্গে সঙ্গে তিনি দৌঁড়ে গিয়ে নিকটস্থ পুকুরে ঝাপিয়ে পড়েন। মূলত হযরত মালেক শাহ (রহ.) ফানাফিল্লাহ জগতে বিচরণ করায় তারই আপাদমস্তক অন্য সাধারণ মানুষের চেয়ে ভিন্নতর হওয়া স্বাভাবিক। (সুবহানাল্লাহ'),
        SizedBox(height: 4),
        Text(
            'মালেক শাহ (রহ.) কুতুবদিয়া কে নিয়ে যে ভবিষ্যৎ বাণী করেছেন:', style: TextStyle(fontWeight: FontWeight.bold, fontSize: 14,),),
        SizedBox(height: 4),
        Text(
            'এই মাজারের খাদেম আবদুর রহমান জানান, তিনি ভক্তদের বলতেন, কুতুবদিয়ার চারদিক আলোকিত হবে। কুতুবদিয়ায় বিদ্যুৎ আসবে, এ অঞ্চল বাণিজ্যিক হাব হবে, দেশ বিদেশে এ দ্বীপের গুরুত্ব বাড়বে। দলে দলে কুতুবদিয়ায় দেশি বিদেশিরা আসবে। প্রচুর প্রাকৃতিক খনিজ সম্পদ আছে এ দ্বীপের চারপাশে। এখন তার নমুনা পরিলক্ষিত হচ্ছে, বৈদ্যুতিক আলো জলছে কুতুবদিয়ায়, লাইটার জাহাজের আলোতে আলোকিত হচ্ছে কুতুবদিয়ার চারদিক, কুতুবদিয়ার অদূরেই পার্শ্ববর্তী মাতারবাড়িতে হচ্ছে গভীর সমুদ্রবন্দর, উন্নত হয়েছে যোগাযোগ ব্যবস্থা, কুতুবদিয়া দ্বীপের দক্ষিণ পশ্চিম সমুদ্রে চলছে তেল গ্যাস অনুসন্ধান কার্যক্রম। সব মিলেছে মালেক শাহ (রহ.) এর ভবিষ্যৎ বাণী অক্ষরে অক্ষরে প্রমাণিত হচ্ছে। তাই আল্লাহর এই অলির মাজার প্রাঙ্গণে প্রতিদিন শত সহস্র লোক সমবেত হচ্ছে। শুধু তাই নয় অসংখ্য পর্যটক ও এই দরবারে আসছে প্রতিবছর।'),
        SizedBox(height: 4),
        Text(
            'কুতুব শরীফ দরবারের কিছু বৈশিষ্ট্য:', style: TextStyle(fontWeight: FontWeight.bold, fontSize: 14),),
        SizedBox(height: 4),
        Text('১. বেনামাজির জন্য দরবারের ভাত হারাম।'),
        Text('২. বার্ষিক ফাতেহার সময় মহিলা দরবারে আসা নিষেধ।'),
        Text('৩. রাজা-প্রজা,ধনী-গরিব,ফকির-মিসকিন এক সঙ্গে বসে খানা খাবে।'),
        Text(
            '৪. দরবারী মেহমানের জন্য ফ্রি রাত্রি যাপনের জন্য আলাদা মেহমান খানা রয়েছে।'),
        Text(
            '৫. মহিলাদের জন্য ইবাদত করার, জিয়ারত করার, থাকার জন্য আলাদা ঘর। যেখানে পুরুষের প্রবেশাধিকার নিষিদ্ধ।'),
        Text('৬. তিন বেলা খানা, থাকা সম্পূণ ফ্রি।'),
        Text('৭. মূল্যবান জিনিসপত্র ফ্রি জমা রাখার জন্য সু-ব্যবস্থা।'),
        Text('৮. শরীয়ত এর বর্হিভূত কাজ নিষিদ্ধ।'),
        Text(
            '৯. ওরশ চলাকালীন সময়ে প্রত্যেক এলাকার  জন্য আলাদা পেন্ডল এবং খানা সম্পূর্ন ফ্রি।'),
        Text(
            '১০. শরীয়তের রাহবার আলেম-ওলামাদের জন্য আলাদা আপ্যায়নের ব্যবস্থা। '),
      ],
    );
  }
}
