import 'package:flutter/material.dart';
import 'package:kutubdia/prestation/UI/Screens/history_malek_sah.dart';

class SpectacularPlace extends StatelessWidget {
  const SpectacularPlace({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        backgroundColor: Colors.red.shade600,
        title: const Text(
          'Spectacular Place',
          style: TextStyle(
              fontSize: 24, fontWeight: FontWeight.bold, color: Colors.white),
        ),
      ),
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(8.0),
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              const Text(
                '* বায়ুবিদ্যুৎ প্রকল্প (বায়ুকল)',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 16),
              ),
              const SizedBox(height: 4),
              Center(child: Image.asset('assets/air.jpeg')),
              const SizedBox(height: 4),
              const Text(
                  'বাতাসের সাথে ঘুরছে পাকা। আর এতে তৈরি হচ্ছে বিদ্যুৎ। কুতুবদিয়ার বাড়িঘরে জ্বলছে বাতি। এই যেন এক নতুন আনন্দ দ্বীপবাসীর কাছে। গেল বছরের দ্বীপ উপজেলায় বায়ুবিদ্যুৎ প্রকল্প উদ্বোধনের পর সর্বসাধারনের ঘরে ঘরে সংযোগ চালু হয় এই বিদ্যুতের। তবে এর আগে ২০০৮ সালে আরো একটি বায়ু বিদ্যুৎ কেন্দ্র তৈরি করে সরকার।তবে বিভিন্ন সময়ে ঘূর্ণিঝড় এবং জলোচ্ছ্বাসে তা নষ্ট হয়ে যাওয়ায় সম্প্রতি নির্মিত এই বাযু বিদ্যুৎ কেন্দ্রের স্থায়ীত্ব নিয়ে সংশয় প্রকাশ করছেন অনেকেই। যদিওবা এই কেন্দ্রটি ঘূর্ণিঝড় এবং জলোচ্ছ্বাসে তেমন ক্ষতি হবে না বলে জানালেন বিদ্যুৎ বিভাগের কর্মকর্তারা।বিদ্যুৎ বিভাগ সূত্রে জানায়, ২০১৬ সালে সড়কের পাঁশঘেষে ২৩ কোটি ৭৭ লাখ টাকা ব্যয়ে স্থাপন করা হয় ২০ টারবাইনের বায়ু বিদ্যুৎ কেন্দ্র। বর্তমানে এই কেন্দ্র থেকে দিনে একটানা ছয় থেকে আট ঘন্টা বিদ্যুৎ সুবিধা পাচ্ছে এলাকার সাড়ে ৭শ পরিবার। উপকুলীয় এলকায় প্রতিটি মানুষের ঘরে ঘরে বিদ্যুৎ পৌঁছে দেয়ার লক্ষে ১২ কোটি টাকা ব্যয়ে ২০০৮ সালে দেশে প্রথমবারের মতো চালু করা হয় বাযু বিদ্যুৎ কেন্দ্র।কক্সবাজারের কুতুবদিয়ায় এক মেগাওয়ার্ড ক্ষমতা সম্পন্ন বিদ্যুৎ প্রকল্পটি চালু হওয়ার ৯ বছরের মধ্যে একাধিকবার ঘূর্ণিঝড়ের কবলে পড়লে তা বিকল হয়ে যায়। বারবার সংস্কার আর পুননির্মানে সরকারের ব্যয় হয় অনেক টাকা। তারপরও এই ধরনের প্রকল্প থেকে পিচপা হয়নি সরকার। ২০১৭ সালে নতুন ২৩ কোটি ৭৭ লক্ষ টাকা ব্যয় করে আরো একটি ১ মেগাওয়ার্ড ক্ষমতা সম্পন্ন বিদ্যুৎ কেন্দ্র চালু করেছে সরকার। আর এতে বিদ্যুৎ সুবিধা পাচ্ছে দ্বীপ এলাকার মানুষ।'),
              const SizedBox(height: 4),
              const Text(
                '* কুতুব শরীফ দরবার',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 16),
              ),
              const SizedBox(height: 4),
              Center(child: Image.asset('assets/hujur.png')),
              const SizedBox(height: 4),
              const MalekSah(),
              const SizedBox(height: 4),
              const Text(
                '* কুতুব আউলিয়ার মাজার',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 16),
              ),
              const SizedBox(height: 4),
              Center(child: Image.asset('assets/kutub.png')),
              const SizedBox(height: 4),
              const Text(
                  'হযরত কুতুবুদ্দীন আউলিয়া  (রহঃ)  এর মাজার শরিফ পাশে রয়েছেন ইমামে আহলে সুন্নাত, আল্লামা গাযী শেরে বাংলা (রহ.) এর সহযোগী হিসেবে যিনি বাতিলদের সাথে মোনাযিরা করতেন, কুতুবদিয়ার সেই বিখ্যাত আলেম ও ওলী হযরত হাকিম শামছুদ্দোহা সিদ্দিকী প্রকাশ: তলোয়ার বাংলা (রহ.) এর সাদামাটা মাজার শরীফ'),
              const SizedBox(height: 4),
              const Text(
                '* বড়ঘোপ সমুদ্র সৈকত',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 16),
              ),
              const SizedBox(height: 4),
              Center(child: Image.asset('assets/borgup.jpeg')),
              const SizedBox(height: 4),
              const Text('বড়ঘোপ সমুদ্র সৈকত'),
              const SizedBox(height: 4),
              const Text(
                '* প্রাকৃতিক উপায়ে লবণ তৈরির মাঠ',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 16),
              ),
              const SizedBox(height: 4),
              Center(child: Image.asset('assets/6.jpg')),
              const SizedBox(height: 4),
              const Text(
                  'প্রথমে সমতল জমির চারপাশ কেটে মাটির আল দিয়ে ঘিরে উঁচু বেড়ার মত কয়েকটি ছোট ছোট প্লট আকারে ভাগ করে নেওয়া হয়। সেই জমির উপর পলিথিন বিছিয়ে দিয়ে নদী বা সমুদ্র থেকে শ্যালো মেশিনের সাহায্যে নোনা জল তুলে সেই প্লট গুলিকে ভরা হয়। এইভাবে টানা রোদে ৬ থেকে ৮ দিন জল রেখে দিলে প্রখর রোদে ধীরে ধীরে জল বাষ্পীভূত হয়ে ওই পলিথিনের উপর লবণ থিতিয়ে পড়তে শুরু করে। জল বাষ্পীভূত হয়ে যাওয়ায় লবণ জমতে শুরু করে ওই পলিথিনের উপরেই। লবণ চাষিরা যখন একটি বড় তক্তা কাঠের সাহায্যে সেই লবণ একত্রিত করে তখন সেই পদ্ধতি অত্যন্ত অপরিষ্কার। এইভাবে খালি পায়ে, খোলা আকাশের নিচে লবণ চাষিদের এমনভাবে লবণ তৈরি করতে দেখে মনে হবে যে এটি খেলে পেটের গন্ডগোল থেকে কেউ বাঁচাতে পারবে না।'),
              const SizedBox(height: 4),
              const Text(
                '* কুতুবদিয়া বাতিঘর',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 16),
              ),
              const SizedBox(height: 4),
              Center(child: Image.asset('assets/batighor.jpg')),
              const SizedBox(height: 4),
              const Text(
                  '১৮৪৬ সালে নির্মিত কুতুবদিয়া বাতিঘর, কক্সবাজার। আর্কিটেক্ট: বৃটিশ ইঞ্জিনিয়ার বার্মিংহাম। নির্মানে: চট্টগ্রাম বন্দর কর্তৃপক্ষ। দৈনিক প্রথম আলোর সহযোগিতায় মার্কিন দূতাবাসের "অ্যাম্বাসেডরস ফান্ড ফর কালচারাল প্রিজারভেশন" ( এএফসিপি ) তে অনুদান প্রতিযোগিতার জন্য কনসেপ্ট নোট প্রকল্পের আওতায় কালের সাক্ষী এই বাতিঘরটিকে ঐতিহাসিক ভবন, প্রত্নতাত্ত্বিক স্থান হিসেবে সংরক্ষণ করা অথবা কুতুবদিয়ার মূল ভূখণ্ডে ঠিক পুরোনোটার আদলে একটি নতুন করে নির্মাণের আবেদন করেছি। এখনো কার্যকর কোন Response পাই নি।উল্লেখ্য, এই বাতিঘরটি প্রায় ১৩০ বছর ধরে, বংগোপসাগরে খারাপ আবহাওয়ার সময়, রাতের বেলা জাহাজকে সঠিক পথ দেখাতো, দিক নির্ণয়ে সহায়তা করতো। ১৯৭৭ সালে মুক্তিপ্রাপ্ত বাংলা চলচ্চিত্র "যাদুর বাঁশী"তে এই বাতিঘরটা দেখানো হয়েছে।'),
              const SizedBox(height: 4),
              const Text(
                '* মুক্তমঞ্চ',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 16),
              ),
              const SizedBox(height: 4),
              Center(child: Image.asset('assets/monce.jpg')),
              const SizedBox(height: 4),
              const Text('এটি বড়ঘোপ সমুদ্র সৈকত বেড়িবাধ সংলগ্ন বেলাভূমি রেস্টুরেন্ট এর পশ্চিমে অবস্থিত। সকাল, সন্ধ্যা, রাত মানুষ এখানে সময় কাটাতে আসে এবং ফ্রেশ বাতাশ উপভোগ করে।'),
              const SizedBox(height: 4),
              const Text(
                "* কুতুবদিয়ায় মহিয়সী মহিলার অসিয়তে ‘কালারমার মসজিদ’",
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 16),
              ),
              const SizedBox(height: 4),
              Center(child: Image.asset('assets/kalmar.png')),
              const SizedBox(height: 4),
              const Text(
                  'কুতুবদিয়ায় প্রায় ৫শ’ বছর আগে মোগল আমলে প্রতিষ্ঠিত ‘কালারমার জামে মসজিদ’। উপজেলা সদর হতে প্রায় ১১ কি.মি. উত্তরে ১নং উত্তর ধূরুং ইউনিয়নে অবস্থিত এ মসজিদটি ঐতিহাসিক নিদর্শন।দ্বীপের সবচেয়ে এ প্রাচীন মসজিদ প্রতিষ্ঠাতার নাম, নির্মাণসন ও নামকরণের সঠিক কোন লিখিত ইতিহাস না থাকলেও  জনশ্রুতি রয়েছে যে, প্রায় ৫শ’বছর আগে  গ্রামের এক মহিয়সী মহিলা তাঁর স্বামীকে অসিয়ত করেছিলেন ‘তাঁর মৃত্যুর পর যেন একটি স্মৃতি চিহ্ন স্থাপন করা হয়’। তাঁদের ঔরসে ছিল ‘কালা’ নামের একটিমাত্র পুত্র সন্তান। পরে ওই মহিলার স্বামী তাঁর প্রিয় স্ত্রীর অসিয়তমতে গোল পাতার ছাউনি দিয়ে একটি মসজিদ নির্মাণ করে এটিকে ‘কালারমার মসজিদ’ নামকরণ করেছিলেন। বিশেষত জেলেসহ অন্য পেশাজীবীরা সাগরে বিভিন্ন বিপদের সম্মুখিন হলে এ মসজিদের জন্য মানত করে বিপদ থেকে মুক্তি লাভ করেন বলে জানা যায়।'),
              const SizedBox(height: 4),
              const Text(
                '* ফকিরা মসজিদ',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 16),
              ),
              const SizedBox(height: 4),
              Center(child: Image.asset('assets/fakira.jpg')),
              const SizedBox(height: 4),
              const Text('কক্সবাজার জেলার দ্বীপ উপজেলা কুতুবদিয়ায় রয়েছে হাজার বছরের ইতিহাস ও ঐতিহ্যের প্রাচীনতম নিদর্শন অমজাখালীর ফকিরা মসজিদ। উপজেলার বড়ঘোপ ৪নং ওয়ার্ডে প্রাচীন এ মসজিদটি অবস্থিত। হিন্দু-মুসলিম সব ধর্মের মানুষ এ মসজিদের প্রতি বিশেষ ভক্তি প্রদর্শন করে থাকেন। বরকত, ফজিলত ও তাৎপর্যপূর্ণ এ মসজিদ দেখতে দেশ-বিদেশ থেকে ধর্মপ্রাণ মুসলমানদের সমাগম ঘটে।এ মসজিদ কখন প্রতিষ্ঠিত হয়েছিল তার সঠিক ইতিহাস কারও জানা নেই। কথিত আছে, প্রায় তিনশ বছর আগে মুঘল সম্রাট আওরঙ্গজেবের সময় বুজুর্গ উমেদ খান চট্টগ্রাম ও রামুর আরাকানী দুর্গ জয় করেন। সে সময় কুতুবদিয়া দ্বীপে আরাকানি ও ফিরিঙ্গিদের উপস্থিতি ছিল। পরে আরাকানি ও ফিরিঙ্গিরা চট্টগ্রাম থেকে বিতাড়িত হলে এ অঞ্চলে ব্যাপকভাবে মুসলমানদের আগমন ঘটে। সে সময় এটি নির্মিত হয় বলে অনেকেরই ধারণা। অপরদিকে স্থানীয় ফকির নামক ব্যক্তি তার স্ত্রীর নামে এ ফকিরনী মসজিদ প্রতিষ্ঠা করেন বলে এলাকাবাসী সূত্রে জানা যায়।প্রথমে মসজিদটি ছিল কাঁচা ঘর। পরে মাটি দিয়ে এটিকে পুনর্নির্মাণ করা হয়। ১৯৭৫-৭৬ সালের দিকে এটিকে পাকা করা হয়। ১৯৯১ সালের পরে এলাকাবাসী নিজস্ব অর্থায়নে এটিকে এক তলাবিশিষ্ট একটি সুরম্য দালানে রূপ দেয়। এখন এটিকে দোতলা করা হয়েছে। বর্তমানে মসজিদের স্থাবর সম্পদের মধ্যে পুকুর, ফোরকানিয়া মাদ্রাসা ও এলাকাবাসীর কবরস্থানসহ মোট ৬ কানি জমি রয়েছে। মসজিদকে ঘিরে এলাকায় নানা ধরনের গুজব প্রচলিত রয়েছে। যেমন মসজিদের অবস্থানটি ছিল জিন-ভুতের বিচরণস্থল। ফলে মানুষ এখানে এশার এবং ফজরের নামাজ পড়তে যেতে ভয় পেত। এ মসজিদকে সামনে রেখে বা এর নামে কোনো শপথ করে তা রক্ষা না করলে চরম শাস্তি পেতে হতো। এমন কয়েকটি ঘটনায় কয়েকজনের মৃতু্য ঘটেছে বলেও লোকমুখে প্রচলিত রয়েছে। রাতে মসজিদ ঘিরে আলোর ঝলক দেখা দিত বলে অনেকের ধারণা। ১৯৯১ সালে ভয়াবহ ঘূর্ণিঝড়ের সময় পুরো কুতুবদিয়া পানিতে ভাসছিল। সে সময় এখানকার হাজারো মানুষ মৃতু্যবরণ করলেও এ মসজিদের তেমন ক্ষয়ক্ষতি হয়নি ও পানিতে ডুবে যায়নি। মসজিদে গিয়ে সন্তান চাইলে নিঃসন্তান দম্পতি সন্তান লাভ করে বলেও প্রচলিত আছে।ঐতিহাসিক অমজাখালী ফকিরা মসজিদ দেখতে প্রতিদিন বিভিন্ন এলাকা থেকে দর্শনার্থী আসেন। বিশেষ করে প্রতি শুক্রবার দূর-দূরান্ত থেকে মানত নিয়ে আসেন বহু নারী-পুরুষ। মানত হিসেবে দেওয়া হয়ে থাকে নগদ টাকা, মোরগ-মুরগি এবং ছাগল।'),
              const SizedBox(height: 4),
              const Text(
                '* সিটিজেন পার্ক',
                style: TextStyle(fontWeight: FontWeight.bold, fontSize: 16),
              ),
              Center(child: Image.asset('assets/citygen.jpg')),
              const SizedBox(height: 4),
              const Text('উপজেলা সূত্রে জানা যায়, কুতুবদিয়া উপজেলায় পর্যটকদের বিনোদনের জন্য ২০১৮ সনের ৩০মে সরকারি ও বেসরকারী অনুদানে তৎকালীন উপজেলা নির্বাহী কর্মকর্তা সুজন চৌধুরীর উদ্যোগে এ প্রকল্পটি হাতে নেওয়া হয়। গড়ে তোলেন বিভিন্ন প্রাণীর ম্যুরাল। পরে ২০২১ সনের ৮ মে কুতুবদিয়া-মহেশখালীর সংসদ সদস্য আশেক উল্লাহ রফিক পুণরায় সৌন্দর্য বৃদ্ধি সহ ক্ষতিগ্রস্ত ম্যুরাল নির্মাণের একটা বরাদ্দ দেন।')
            ],
          ),
        ),
      ),
    );
  }
}
